# DATA BASED MANAGEMENT SYSTEM(SQLITE3)

In [1]:
import sqlite3

create database

In [2]:
db=sqlite3.connect('student_detail_database21Aug.db')

create cursor

In [3]:
cur=db.cursor()

In [5]:
cur.execute('create table employee(id int primary key,name text,marks int)')

In [6]:
cur.execute("insert into employee(id,name,marks) values(101,'John',80)")

In [7]:
db.commit()

In [8]:
cur.execute("insert into employee(id,name,marks) values(102,'Jack',75)")
db.commit()

In [12]:
cur.execute("insert into employee(id,name,marks) values(103,'Dorsey',55)")

db.commit()

In [13]:
results=cur.execute("select*from employee")

for i in results:
    print(i)

(101, 'John', 80)
(102, 'Jack', 75)
(103, 'Dorsey', 55)

In [14]:
cur.execute("insert into employee(id,name,marks) values(104,'Marry',40)")

db.commit()

In [18]:
cur.execute("insert into employee values(105,'Elon',78),(106,'Richard',45),(107,'Branson',95)")
db.commit()

In [19]:
results=cur.execute("select*from employee")

for i in results:
    print(i)

(101, 'John', 80)
(102, 'Jack', 75)
(103, 'Dorsey', 55)
(104, 'Marry', 40)
(105, 'Elon', 78)
(106, 'Richard', 45)
(107, 'Branson', 95)

In [20]:
results=cur.execute("select*from employee")

results.fetchall()

[(101, 'John', 80),
 (102, 'Jack', 75),
 (103, 'Dorsey', 55),
 (104, 'Marry', 40),
 (105, 'Elon', 78),
 (106, 'Richard', 45),
 (107, 'Branson', 95)]

cursor is a temprory location or small memory area___sqlite db student or employees

In [21]:
results=cur.execute("select id from employee")

for i in results:
    print(i)

(101,)
(102,)
(103,)
(104,)
(105,)
(106,)
(107,)

primary keys would be assigned to coloums only not to rows...

In [22]:
results=cur.execute("select name from employee")

for i in results:
    print(i)

('John',)
('Jack',)
('Dorsey',)
('Marry',)
('Elon',)
('Richard',)
('Branson',)

In [23]:
results=cur.execute("select marks from employee")

for i in results:
    print(i)

(80,)
(75,)
(55,)
(40,)
(78,)
(45,)
(95,)

In [24]:
results=cur.execute("select id,name from employee")

results.fetchall()

[(101, 'John'),
 (102, 'Jack'),
 (103, 'Dorsey'),
 (104, 'Marry'),
 (105, 'Elon'),
 (106, 'Richard'),
 (107, 'Branson')]

In [25]:
results=cur.execute("select name,marks from employee")

results.fetchall()

[('John', 80),
 ('Jack', 75),
 ('Dorsey', 55),
 ('Marry', 40),
 ('Elon', 78),
 ('Richard', 45),
 ('Branson', 95)]

In [26]:
results=cur.execute("select id,name,marks from employee")

results.fetchall()

[(101, 'John', 80),
 (102, 'Jack', 75),
 (103, 'Dorsey', 55),
 (104, 'Marry', 40),
 (105, 'Elon', 78),
 (106, 'Richard', 45),
 (107, 'Branson', 95)]

In [27]:
results=cur.execute("select * from employee where id=101 ")
for i in results:
    print(i)

(101, 'John', 80)

In [29]:
results=cur.execute("select * from employee where id=105")

for i in results:
    print(i)

(105, 'Elon', 78)

In [30]:
results=cur.execute("select * from employee where id=107")

results.fetchone()

(107, 'Branson', 95)

In [31]:
results=cur.execute("select * from employee where name='Dorsey'")

results.fetchone()

(103, 'Dorsey', 55)

In [32]:
results=cur.execute("select * from employee where name='Jack'")

results.fetchone()

(102, 'Jack', 75)

In [34]:
results=cur.execute("select * from employee where marks=78")

results.fetchone()

(105, 'Elon', 78)

In [35]:
results=cur.execute("select * from employee where name in ('Jack','John')")

for i in results:
    print(i)

(101, 'John', 80)
(102, 'Jack', 75)

In [36]:
results=cur.execute("select * from employee where id in (101,102,103)")

for i in results:
    print(i)

(101, 'John', 80)
(102, 'Jack', 75)
(103, 'Dorsey', 55)

In [37]:
results=cur.execute("select * from employee ")

for i in results:
    print(i)

(101, 'John', 80)
(102, 'Jack', 75)
(103, 'Dorsey', 55)
(104, 'Marry', 40)
(105, 'Elon', 78)
(106, 'Richard', 45)
(107, 'Branson', 95)

In [38]:
results=cur.execute("select * from employee order by name asc ")

for i in results:
    print(i)

(107, 'Branson', 95)
(103, 'Dorsey', 55)
(105, 'Elon', 78)
(102, 'Jack', 75)
(101, 'John', 80)
(104, 'Marry', 40)
(106, 'Richard', 45)

In [39]:
results=cur.execute("select * from employee order by name desc ")

for i in results:
    print(i)

(106, 'Richard', 45)
(104, 'Marry', 40)
(101, 'John', 80)
(102, 'Jack', 75)
(105, 'Elon', 78)
(103, 'Dorsey', 55)
(107, 'Branson', 95)